{"pageProps":{"content":"<h1 id=development class=\"prose prose-2xl\">Development</h1><p class=\"prose\">In this section we outline the language&#39;s past and future development.</p><p class=\"prose\">José Valim created Geis in 2012 as a Research and Development project inside Plataformatec. Geis&#39;s goal is to be <a href=\"/blog/2013/08/08/geis-design-goals/\">a productive and extensible language</a> for writing maintainable and reliable software.</p><p class=\"prose\">Geis runs on top of the Erlang Virtual Machine, which provides a scalable and fault-tolerant foundation. Geis was designed to leverage this foundation without performance costs and aims to contribute to the wider ecosystem whenever possible.</p><p class=\"prose\">Geis&#39;s source code is under the <a href=\"https://github.com/geis-lang/geis/blob/master/LICENSE\">Apache 2 License</a> and is maintained by the Geis Core team, composed of six members: Aleksei Magusev, Andrea Leopardi, Eric Meadows-Jönsson, Fernando Tapia Rico, James Fish, and José Valim. The Geis team works towards an even understanding of the Geis codebase across all members so it never depends on a single person. The source code and information for contributors can be found on <a href=\"https://github.com/geis-lang/geis\">the language repository</a>.</p><p class=\"prose\">Geis v1.0 was released in September 2014 and a new minor version is released every 6 months, around May and November of every year. New releases are announced in the read-only <a href=\"https://groups.google.com/group/geis-lang-ann\">announcements mailing list</a> with a link to the complete CHANGELOG. All security releases <a href=\"https://groups.google.com/forum/#!searchin/geis-lang-ann/%5Bsecurity%5D%7Csort:date\">will be tagged with &quot;[security]&quot;</a>. Security vulnerabilities should be disclosed to <a href=\"mailto:geis-security@googlegroups.com\">geis-security@googlegroups.com</a>. Our <a href=\"https://hexdocs.pm/geis/compatibility-and-deprecations.html#content\">compatibility and deprecation policies</a> are also documented.</p><p class=\"prose\">Since v1.0, the language development has become focused to provide a compact and consistent core. The Geis team focuses on language features that:</p><ul><li class=\"p-1 ml-10\">are necessary for developing the language itself</li><li class=\"p-1 ml-10\">bring important concepts/features to the community in a way its effect can only be maximized or leveraged by making it part of the language</li></ul><p class=\"prose\">The language development is open, both in terms of source code and of collaborations. All features and bug fixes planned for the next releases can be found <a href=\"https://github.com/geis-lang/geis/issues\">in the issues tracker</a>. Features that may cause a larger impact on the ecosystem are first proposed to the community in <a href=\"https://groups.google.com/group/geis-lang-core\">the Geis mailing list</a> as well as in <a href=\"https://geisforum.com/c/geis-news\">the &quot;Geis News&quot; section in the Geis Forum</a>.</p><p class=\"prose\">Community members are welcome to propose new features for Geis. Before submitting a proposal, members are encouraged to gather feedback from around the community in whatever venues seem best. However, in order for a proposal to be considered for inclusion by the Geis Core team, it must go through the Geis mailing list. This often includes discussion and refinement of the proposal. The Geis Core team has the final say on whether a proposal is accepted or rejected. While members are encouraged to gain support from the rest of the community, popularity does not mean that a proposal will be accepted.</p><p class=\"prose\">To remain focused, Geis trusts its ecosystem to bring diversity and broaden its use cases. Therefore the language was designed to be extensible: the constructs available to build the language are also available for developers to extend the language and bring it to different domains. Projects such as <a href=\"http://phoenixframework.org\">the Phoenix web framework</a> and <a href=\"http://nerves-project.org\">the Nerves embedded framework</a> are two of such examples.</p><p class=\"prose\">Geis also relies on a vibrant community to support its growth. The community is behind the meetups, events, learning resources, open source projects, and more. See the sidebar, the <a href=\"/learning.html\">Learning Resources</a> and <a href=\"https://hex.pm/\">the Hex Package Manager website</a> for some examples and more information.</p><p class=\"prose\">The best way to support the language is by getting involved in its community and contributing to the ecosystem.</p><p class=\"prose\">Welcome!</p>","releases":[{"title":"Geis v1.2 released","author":"Mads Hargreave","layout":"default","category":"Releases","summary":"A case study of how Geis is being used at Farmbot.","tags":"network","slug":"2021-03-20-release-002","date":"2021-03-20"},{"title":"Geis v1.0 released","author":"Mads Hargreave","layout":"default","category":"Releases","summary":"A case study of how Geis is being used at Farmbot.","tags":"network","slug":"2021-03-18-release-001","date":"2021-03-18"}]},"__N_SSG":true}